<?php

mb_regex_encoding('UTF-8');
mb_internal_encoding("UTF-8");

$text = "ШЮКИХИВЗЙЦИЄІЗХШГЬЇЙЦШЖХФКХЇІЩМЖХЛВГЧЙІЬХРВЇІБЮЖЮИГФРВОЇІЖХОЇЙВОІЬАМШКМКГЬИЯКЮЖІЛЦЗХЧЦРМАВЛЮЖГШКЮЖЦМКШХЛЄІШВОЇЖЦЛЛХОБЗІЖВЛІШИВЄЦЗВШЙМЄЦОШЮЖВЄІФЛІЖЇІФЇЙХЗМФРВОМПЮЙЄШМКЇЙЦШЬГКУІЩІЬИГИЮЬГЖХГСШВЬЄЦЇІРИЮЛУКХЙЦИИХІЧГЬИХХШВЙГСМФЇЙВЕИХЛВШИГЕМРЦКЛУЦЖЮКЇЮЙСМШГЬЇІРВЛВИЮЧЦЩЦЛІИЦПШВИЛЦЙТІІЛІРМЯПЮЙЄШМЛІЗМТІХИЮЧЦЩЦЛІЙІБЇЦЖЮИГЖВЕОІЬІФМПЮЕРЦКРВЛЦФРВЙГБИГИЦЇВКВИЦЗІЩВЖЦОХРМФХЄЬБШІИЦЙЇГЬИГЗЦЯЛУКХИЦЬБШГИВПФГБЦМШЦАМФИЦШЮЙОГШПГДДИЮШЮЖВЄВЕКГЖУКУЄВЕЬБШГИТІЇІШВИИВЕШІБШЮКЛВЛВЇІРЦЛІЄЧІЩІКЖМАГИИХХЄВЕКУРЦКШГИШВКВЛУТЮИЮЙМОІЗІЦЖЮЇІЛГЗЇІРВИЦЯЄІЖВШЦЛВКХГЙЦЇЛІЗЖМИЦФЛУЕІЩІЩІЖІКИГЇЙІИВБЖВШГБШМЄВЬІЛІЩІЩІЖІКИГГЇЙІИВБЖВШГТІХЇЙІКВЇЦФКХШВХШЖХЯЛУКХТІПГБШМЄВШВЬЦЯЬБШГИІРІЄЧМЬВЖУИВЄЦ";
$alph = ['А','Б', 'В', 'Г', 'Д', 'Е', 'Є', 'Ж', 'З', 'И', 'І', 'Ї', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ю', 'Я'];


for ($i = 1; $i < count($alph); $i++) {

    $var = $text;
    $str = '[KEY: ' . $i . ']: ';
    $charlist = preg_split('/(?<!^)(?!$)/u', $var);
    foreach ($charlist as $symbol) {
        $pos = array_search($symbol, $alph);
        if (($pos + $i) > count($alph) - 1)  $pos = $i - (count($alph) - $pos);
        else $pos += $i;
        //$var = str_ireplace($symbol, $alph[$pos], $var);
        $str .= $alph[$pos];
    }
    
    echo $str . "\n\n" . str_repeat('=', 75) . "\n\n";
}
?>
